package database;

public class datebase_note {

}
/*
 * 1. 데이터와 데이터베이스
 * 
 * 	1) 데이터베이스의 개념 및 정의
 * 		- 기존의 파일시스템에서 중복된 정보를 효율적으로 처리하는 것
 * 			이 중복을 피하여 정보를 일원화하여 처리를 효율적으로 수행하기 위해서
 * 			서로 관련성을 가지며 중복이 없는 데이터의 집합을 유지하는 것
 * 
 * 			데이터베이스를 관리하는 시스템 = DBMS(DataBase Management System)
 * 			
 * 			데이터베이스의 대표적인 구조
 * 				a. 트리구조(tree structure)인 구조적 데이터베이스
 * 					- 트리구조 제일 꼭대기 = root
 * 					- 꼭대기 하위항목들 = node
 * 				b. 관계형 데이터베이스(relational database)
 * 				c. 객체지향 데이터베이스 구조 
 * 		
 * 	2) 파일 시스템의 정의
 * 		- 컴퓨터 파일에 이름을 붙이고, 저장이나 검색을 위해 
 * 			논리적으로 그것들을 어디에 위치시켜야 하는지 등을
 * 			나타내는 방법
 * 
 * 		- 
 * 
 *  데이터베이스에서 수행되는 최소 연산(CRUD)
 *  	Create, Read, Update, Delete
 *  
 *  오라클 데이터베이스에서 데이터 저장 및 산출은 테이블(표)형태로 한다
 *  	데이터 조회 결과는 무조건 테이블(표) 형태로 나온다
 *  	
 *  재명명 연산은 중간 결과나 최종 결과에 대한 테이블명이 변경됨
 *  본래 데이터베이스에 저장된 테이블명까지 변경되는 것은 아님
 *  	-> 출력될 때 나오는 테이블명이 변경되는 것일 뿐, 실질적인 테이블명이 변경되는 것이 아님
 *  
 *  
 *  새 코딩테스트 사이트: programmers
 *  
 */
